/*
ДАНО:
Есть две горки с камнями. Есть два игрока. 
Игроки ходят по очереди. Начинает ходить первый игрок.
За ход каждый игрок может выбрать одно из трёх действий:
Взять один камень с левой горки. Взять один камень с правой горки. 
Взять по одному камню с каждой горки.

ВХОДНЫЕ ДАННЫЕ:
n — размер первой горки. m — размер второй горки.

ЦЕЛЬ АЛГОРИТМА:
Определить в каких случаях победит первый игрок,
если второй игрок ходит безошибочно.

КЛЮЧ:
Игрок 1 проиграет в тех случаях, когда n и m чётные.
*/

function fastRocks(n, m) {
  const firstPlayerLose = n % 2 === 0 && m % 2 === 0;
  console.log('1 player is', firstPlayerLose ? 'L' : 'W');
}
fastRocks(2, 2);
