// ************************** START ***************************
// Возведение числа в степень.
// Наивный алгоритм.
function multiply(n, m) {
  if (m === 0) return 1;

  let result = n;
  for (let i = 0; i < m - 1; i++) {
    result = result * n;
  }
  return result;
}
// *************************** END ****************************

// ************************** START ***************************
// Возведение числа в степень.
// Более быстрый алгоритм.
function fastIntegerExponentiation(x, n) {
  let result = 1; // Начальное значение результата
  let base = x; // База для возведения в степень

  while (n > 0) {
    if (n % 2 === 1) {
      result *= base; // Если n нечетное, умножаем результат на базу
    }
    base *= base; // Возводим базу в квадрат
    n = Math.floor(n / 2); // Делим n на 2
  }

  return result; // Возвращаем итоговый результат
}
// *************************** END ****************************
